# Books Core

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

connection_str = "mysql+pymysql://root:root@localhost/books"

In [2]:
engine = create_engine(connection_str)

In [3]:
create_database(connection_str)

In [4]:
database_exists(connection_str)

True

In [5]:
## Check if database exists, if not, create it
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

In [6]:
import pandas as pd
df = pd.read_csv('Data/data.csv')
df.head()

,First Name,Last Name,Email,Book Title,Book Author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [7]:
df.to_sql('data', engine, if_exists = 'replace')

7

In [8]:
q = """SELECT * FROM data LIMIT 5;"""
pd.read_sql(q, engine)

,index,First Name,Last Name,Email,Book Title,Book Author
0,0,John,Doe,JD@books.com,The Shining,Stephen King
1,1,John,Doe,JD@books.com,It,Stephen King
2,2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [9]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0            data

## PART 1

![png](Data/books-model-1.png)

## Part 2

In [10]:
df2 = pd.read_csv('Data/books.csv')
df3 = pd.read_csv('Data/authors.csv')
df4 = pd.read_csv('Data/favorites.csv')
df5 = pd.read_csv('Data/users.csv')

In [11]:
df2.to_sql('books', engine, if_exists = 'replace')
df3.to_sql('authors', engine, if_exists = 'replace')
df4.to_sql('favorites', engine, if_exists = 'replace')
df5.to_sql('users', engine, if_exists = 'replace')

3

In [12]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2            data
3       favorites
4           users

In [15]:
q2 = '''
SELECT 
    books.title, favorites.user_id
FROM
    books
        JOIN
    favorites ON books.id = favorites.book_id
WHERE
    favorites.user_id = (SELECT 
            users.id
        FROM
            users
        WHERE
            (users.last_name = 'Doe'
                AND users.first_name = 'John'));
'''
pd.read_sql(q2, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1